import React from 'react'
import './AboutWithPhotos.css'

const AboutWithPhotos = () => {
	return (
		<div className="about-with-p">
            {/* <p className="desktop-font line-height text-centered">
				Год назад мы провели 3-дневную городскую школу японистики,
				посвящённую средневековой Японии. 27 мероприятий, включая лекции, вака-баттл, открытую дискуссию и
				концерт традиционной японской музыки посетили более 300
				участников. По итогам мероприятия студенты и школьники основали 6
				японистических проектов, 2 из которых успешно завершились, а
				остальные 4 работают до сих пор.
			</p> */}

			<p className="desktop-font line-height text-centered">
				Год назад мы провели 3-дневную городскую школу японистики,
				посвящённую средневековой Японии.
			</p>
			<p className="desktop-font line-height text-centered">
				27 мероприятий, включая лекции, вака-баттл, открытую дискуссию и
				концерт традиционной японской музыки посетили более 300
				участников.
			</p>
			<p className="desktop-font line-height text-centered">
				По итогам мероприятия студенты и школьники основали 6
				японистических проектов, 2 из которых успешно завершились, а
				остальные 4 работают до сих пор.
			</p>

            {/* <p className="desktop-font line-height text-centered marg-t">
				Команда «Юкари» – начинающие японисты и просто группа
				единомышленников, по уши влюблённых в Японию. В нашем составе
				пассионарные студенты и школьники, готовые и шутку пошутить, и
				крупнейшее образовательное событие по Японии провести.
			</p> */}

			<p className="desktop-font line-height text-centered marg-t">
				Команда «Юкари» – начинающие японисты и просто группа
				единомышленников, по уши влюблённых в Японию.
			</p>
            <p className="desktop-font line-height text-centered">
				В нашем составе
				пассионарные студенты и школьники, готовые и шутку пошутить, и
				крупнейшее образовательное событие по Японии провести.
			</p>
		</div>
	)
}

export default AboutWithPhotos
