import React, { useEffect } from 'react'

const Policy = () => {
	useEffect(() => {
		window.scrollTo(0, 0)
	}, [])

	return (
		<div className="padded-container line-height">
			<h1 className="text-centered p-bottom-margin">
				Политика обработки персональных данных
			</h1>
			<h2 className="p-bottom-margin">1. Общие положения</h2>
			<p className="p-bottom-margin">
				Настоящая политика обработки персональных данных составлена в
				соответствии с требованиями Федерального закона от 27.07.2006.
				№152-ФЗ «О персональных данных» и Общеевропейского регламента о
				персональных данных (General Data Protection Regulation, GDPR) и
				определяет порядок обработки персональных данных и меры по
				обеспечению безопасности персональных данных физическим лицом
				Тюленевым Иваном Алексеевичем (далее – Оператор).
			</p>
			<p className="p-bottom-margin">
				1.1 Оператор ставит своей важнейшей целью и условием
				осуществления своей деятельности соблюдение прав и свобод
				человека и гражданина при обработке его персональных данных, в
				том числе защиты прав на неприкосновенность частной жизни,
				личную и семейную тайну.
			</p>
			<p className="p-bottom-margin">
				1.2 Настоящая политика Оператора в отношении обработки
				персональных данных (далее – Политика) применяется ко всей
				информации, которую Оператор может получить о посетителях
				веб-сайта yukarihon.ru.
			</p>
			<h2 className="p-bottom-margin">
				2. Основные понятия, используемые в Политике
			</h2>
			<p className="p-bottom-margin">
				2.1. Автоматизированная обработка персональных данных —
				обработка персональных данных с помощью средств вычислительной
				техники;
			</p>
			<p className="p-bottom-margin">
				2.2. Блокирование персональных данных — временное прекращение
				обработки персональных данных (за исключением случаев, если
				обработка необходима для уточнения персональных данных);
			</p>
			<p className="p-bottom-margin">
				2.3. Веб-сайт — совокупность графических и информационных
				материалов, а также программ для ЭВМ и баз данных,
				обеспечивающих их доступность в сети интернет по сетевому адресу
				yukarihon.ru (далее — Сайт);
			</p>
			<p className="p-bottom-margin">
				2.4. Информационная система персональных данных — совокупность
				содержащихся в базах данных персональных данных, и
				обеспечивающих их обработку информационных технологий и
				технических средств;
			</p>
			<p className="p-bottom-margin">
				2.5. Обезличивание персональных данных — действия, в результате
				которых невозможно определить без использования дополнительной
				информации принадлежность персональных данных конкретному
				Пользователю или иному субъекту персональных данных;
			</p>
			<p className="p-bottom-margin">
				2.6. Обработка персональных данных — любое действие (операция)
				или совокупность действий (операций), совершаемых с
				использованием средств автоматизации или без использования таких
				средств с персональными данными, включая сбор, запись,
				систематизацию, накопление, хранение, уточнение (обновление,
				изменение), извлечение, использование, передачу
				(распространение, предоставление, доступ), обезличивание,
				блокирование, удаление, уничтожение персональных данных;
			</p>
			<p className="p-bottom-margin">
				2.7. Оператор — государственный орган, муниципальный орган,
				юридическое или физическое лицо, самостоятельно или совместно с
				другими лицами организующие и (или) осуществляющие обработку
				персональных данных, а также определяющие цели обработки
				персональных данных, состав персональных данных, подлежащих
				обработке, действия (операции), совершаемые с персональными
				данными;
			</p>
			<p className="p-bottom-margin">
				2.8. Персональные данные — любая информация, относящаяся к прямо
				или косвенно определенному или определяемому Пользователю Сайта;
			</p>
			<p className="p-bottom-margin">
				2.9. Пользователь — любой посетитель Сайта;
			</p>
			<p className="p-bottom-margin">
				2.10. Предоставление персональных данных — действия,
				направленные на раскрытие персональных данных определенному лицу
				или определенному кругу лиц;
			</p>
			<p className="p-bottom-margin">
				2.11. Распространение персональных данных — любые действия,
				направленные на раскрытие персональных данных неопределенному
				кругу лиц (передача персональных данных) или на ознакомление с
				персональными данными неограниченного круга лиц, в том числе
				обнародование персональных данных в средствах массовой
				информации, размещение в информационно-телекоммуникационных
				сетях или предоставление доступа к персональным данным
				каким-либо иным способом;
			</p>
			<p className="p-bottom-margin">
				2.12. Уничтожение персональных данных — любые действия, в
				результате которых персональные данные уничтожаются безвозвратно
				с невозможностью дальнейшего восстановления содержания
				персональных данных в информационной системе персональных данных
				и (или) результате которых уничтожаются материальные носители
				персональных данных.
			</p>
			<p className="p-bottom-margin">
				2.12. Уничтожение персональных данных — любые действия, в
				результате которых персональные данные уничтожаются безвозвратно
				с невозможностью дальнейшего восстановления содержания
				персональных данных в информационной системе персональных данных
				и (или) результате которых уничтожаются материальные носители
				персональных данных.
			</p>
			<h2 className="p-bottom-margin">
				3. Оператор может обрабатывать следующие персональные данные
			</h2>
			<p className="p-bottom-margin">
				3.1. Адрес электронной почты Пользователя.
			</p>
			<p className="p-bottom-margin">
				3.2. Личные имя и фамилия Пользователя.
			</p>
			<p className="p-bottom-margin">
				3.3. Вышеперечисленные данные далее по тексту Политики
				объединены общим понятием Персональные данные.
			</p>
			<p className="p-bottom-margin">
				3.4. Также Пользователь имеет возможность внести добровольный
				финансовый взнос на развитие проекта. Система не сохраняет
				данные владельца карты. Взносы начисляются Тюленеву Ивану
				Алексеевичу на СберКарту №4276 3801 2609 5467, и только он в
				порядке оповещения мобильного банка получает информацию о дате и
				времени транзакции, имени и отчестве владельца карты,
				используемой при платеже, а также последних четырех цифрах
				номера карты.
				<br />
				Система не хранит данные об операциях подобного рода.
			</p>
			<h2 className="p-bottom-margin">
				4. Цели обработки персональных данных
			</h2>
			<p className="p-bottom-margin">
				4.1. Цель обработки персональных данных Пользователя — его
				регистрация на мероприятие «Юкари: однажды в Эдо». Оператор
				также имеет право присылать на собранные адреса электронной
				почты сообщения с дополнительной информацией о мероприятии.
				Пользователь всегда может отказаться от получения информационных
				сообщений, направив Оператору письмо на адрес электронной почты
				yukari.lectorium@gmail.com.
			</p>
			<h2 className="p-bottom-margin">
				5. Правовые основания обработки персональных данных
			</h2>
			<p className="p-bottom-margin">
				5.1. Оператор обрабатывает персональные данные Пользователя
				только в случае их заполнения и/или отправки Пользователем
				самостоятельно через специальные формы, расположенные на Сайте.
				Заполняя соответствующие формы и/или отправляя свои персональные
				данные Оператору, Пользователь выражает свое согласие с данной
				Политикой.
			</p>
			<h2 className="p-bottom-margin">
				6. Порядок сбора, хранения, передачи и других видов обработки
				персональных данных
			</h2>
			<p className="p-bottom-margin">
				Безопасность персональных данных, которые обрабатываются
				Оператором, обеспечивается путем реализации правовых,
				организационных и технических мер, необходимых для выполнения в
				полном объеме требований действующего законодательства в области
				защиты персональных данных.
			</p>
			<p className="p-bottom-margin">
				6.1. Оператор обеспечивает сохранность персональных данных и
				принимает все возможные меры, исключающие доступ к персональным
				данным неуполномоченных лиц.
			</p>
			<p className="p-bottom-margin">
				6.2. Персональные данные Пользователя никогда, ни при каких
				условиях не будут переданы третьим лицам, за исключением
				случаев, связанных с исполнением действующего законодательства.
			</p>
			<p className="p-bottom-margin">
				6.3. В случае выявления неточностей в персональных данных,
				Пользователь может актуализировать их самостоятельно, путем
				направления Оператору уведомление на адрес электронной почты
				Оператора yukari.lectorium@gmail.com с пометкой «Актуализация
				персональных данных»
			</p>
			<p className="p-bottom-margin">
				6.4. Срок обработки персональных данных определяется
				длительностью срока, необходимого для достижения цели обработки
				персональных данных, предусмотренной разделом 4 Политики
			</p>
			<p className="p-bottom-margin">
				6.5. Пользователь может в любой момент отозвать свое согласие на
				обработку персональных данных, направив Оператору уведомление
				посредством электронной почты на электронный адрес Оператора
				yukari.lectorium@gmail.com с пометкой «Отзыв согласия на
				обработку персональных данных».
			</p>
			<p className="p-bottom-margin">
				6.6. Администрация получает персональные данные Пользователя
				исключительно напрямую (через форму регистрации на мероприятие).
			</p>
			<p className="p-bottom-margin">
				6.7. Администрация может раскрывать персональные данные
				Пользователя в рамках закона или для защиты прав и интересов,
				если такое раскрытие является необходимым для соблюдения закона,
				защиты прав Администрации или третьих лиц, а также защиты
				собственности и/или интересов (например, соблюдения условий
				Пользовательского соглашения) или предотвращения мошенничества.
				В частности, Администрация может раскрыть персональные данные
				Пользователя в ответ на официальные запросы со стороны
				государственных органов, например, для удовлетворения требований
				национальной безопасности или правоохранительных органов.
			</p>
			<h2 className="p-bottom-margin">
				7. Трансграничная передача персональных данных
			</h2>
			<p className="p-bottom-margin">
				7.1. Оператор в процессе обработки персональных данных не
				осуществляет их трансграничную передачу.
			</p>
			<h2 className="p-bottom-margin">8. Заключительные положения</h2>
			<p className="p-bottom-margin">
				8.1. Пользователь может получить любые разъяснения по
				интересующим вопросам, касающимся обработки его персональных
				данных, обратившись к Оператору с помощью электронной почты
				yukari.lectorium@gmail.com.
			</p>
			<p className="p-bottom-margin">
				8.2. Пользователь может обновить, изменить или удалить
				Персональные данные, которые он предоставил, отправив
				соответствующий запрос на адрес электронной почты
				yukari.lectorium@gmail.com. По техническим причинам информация
				может быть обновлена, изменена или удалена не сразу, а с
				задержкой. Также необходимо принять во внимание, что возможно
				сохранение части информации в той мере, в которой это необходимо
				для исполнения юридических обязательств, урегулирования споров,
				предотвращения мошенничества и защиты законных интересов
				Администрации.
			</p>
			<p className="p-bottom-margin">
				8.3. В данном документе будут отражены любые изменения политики.
			</p>
		</div>
	)
}

export default Policy
