import React from 'react'
import './About.css'

const About = () => {
	return (
		<div className="container">
			<div className="w-c">
				<div className="wave-cnt" />
				<div className="wave-container relative grad-bg">
					<p className="white desktop-font line-height text-centered ">
						Эксперимент, японистика, вызов, встреча единомышленников
						– это «Юкари».
						<br />
						<br />
						<strong>Наш проект</strong> – это уникальная попытка
						включить живой контакт между экспертами и любителями,
						простыми интересующимися и опытными деятелями в крупное
						образовательное событие по Японии.
						<br />
						<br />
						На этот раз участников ждёт погружение в Японию эпохи
						Эдо (1603-1868 гг.).
						<br />
						Самураи и ронины, Хокусай и хайку, сёгуны и гейши –
						именно эти образы сразу всплывают в беседе о
						традиционной Японии.
						<br />
						10 онлайн-лекций от лучших японистов России позволят
						проникнуть за ширмы княжеских резиденций, пройтись по
						многолюдному Эдо, посетитть театр Кабуки и познакомиться
						с кварталами любви.
						<br />
						<br />
						Более того, после мероприятия мы не бросим вас с этим
						багажом знаний.
						<br />
						Активные участники не только выиграют призы, но и
						получат приглашения в японистические проекты!
						<br />
						<br />
					</p>
				</div>
			</div>
		</div>
	)
}

export default About
