import React from 'react'
import './About.css'

const About = () => {
	return (
		<div className="container">
			<div className="w-c">
				<div className="wave-cnt" />
				<div className="wave-container relative grad-bg">
					<p className="white desktop-font line-height text-centered ">
                        Эксперимент, японистика, встреча единомышленников – это «Юкари».
						<br />
						<br />
						Наш проект – крупное образовательное событие по Японии эпохи Эдо (1603-1868 гг.). Самураи и ронины, Хокусай и хайку, сёгуны и гейши – эти образы сразу всплывают при разговоре о традиционной Японии.
						<br />
						<br />
						<strong>10 онлайн-лекций от лучших японистов России</strong> позволят проникнуть за ширмы императорских дворцов, пройтись по многолюдному Эдо, посетить театр Кабуки и познакомиться с кварталами любви.
						<br />
						<br />
						После мероприятия мы не бросим вас с этим багажом знаний.<br />
                        <strong>Активные участники не только выиграют призы, но и получат приглашения в японистические проекты!</strong>
						<br />
						<br />
					</p>
				</div>
			</div>
		</div>
	)
}

export default About
